#include <stdio.h>
int main() {

    int a = 5,b = 17;//กำหนดค่าเริ่มต้นตัวแปร
    float c = 8.5, d = 4.0;//กำหนดค่าเริ่มต้นตัวแปร

    printf("a = %d, b = %d, c = %.1f, d = %.1f\n", a, b, c, d);//แสดงตัวแปรค่าเริ่มต้น
    
    printf("d + a = %.1f\n", d + a);// 4.0+5 จะได้ 9.0

    printf("a - b = %d\n", a - b);// 5-17 จะได้ -12

    printf("c * d = %.1f\n", c * d);// 8.5คูณ4.0 จะได้ 34.0

    printf("a * c = %.1f\n",a * c);// 5คูณ8.5 จะได้ 42.5

    printf("c / d = %.1f\n", c / d);// 8.5หาร4.0 จะได้ 2.1

    printf("b / c = %.1f\n", (float)b / c);//17หาร8.5 จะได้ 2.0

    printf("a %% b = %d\n", a % b); // 5หาร17 จะได้เศษ 5

    printf("c %% a = %d\n", (int)c % a); // 8.5หาร5 จะได้เศษ 3

    printf("c %% d = %.1f\n", c - (int)c); // 8.5ลบ8 จะได้เศษ 0.5

    return 0;
}

//อภิปรายผลลัพธ์:ค่าตัวแปรกที่ถูกกำหนดค่าไว้จะแปรพันตามการคำนวณที่ทำในแต่ละบรรทัด
//การคำนวณที่ใช้ตัวแปรประเภท int จะให้ผลลัพธ์เป็นจำนวนเต็ม
//การคำนวณที่ใช้ตัวแปรประเภท float จะให้ผลลัพธ์เป็นจำนวนทศนิยม
//การใช้ % สำหรับการหารจะให้ผลลัพธ์เป็นเศษของจำนวนเต็ม