#include <stdio.h>
int main() {

int r1 , r2 , b = 2, a = 5;//ประกาศตัวแปร r1, r2, b, a เป็นจำนวนเต็ม
float r3 , r4 , y = 4.5, x = 3.0;//ประกาศตัวแปร r3, r4 , y , x เป็นจำนวนทศนิยม

printf("r1 = %d\n", r1 = a++ * b + (int)y % 3);
//a=5 ใช้ค่าก่อนแล้วจึงเพิ่มเป็น 6ในภายหลัง
//5 * 2 + y=เอาเศษของ 4.5หาร3มีค่า = 1
//5 * 2 + 1 = 10 + 1 = 11

printf("r2 = %d\n", r2 = (a > b) && ((int)x / b < 2));
//ตัดสิน aมีค่ามากกว่าb ที่ 5>2 เป็นจริง
//ตัดสิน (int)x / b < 2 ที่ 3/2 = 1 เป็นจริง
//ผลลัพธ์เป็น 1 หรือว่าจริง
//ture& true = 1

printf("r3 = %.2f\n", r3 = ++x * y - a / 2);
//++x เพิ่มค่า 1 ก่อนจึงกลายเป็น 4.0 แล้วนำไปใช้
//4.0 * 4.5 - 6 / 2 = 18.0 - 3 = 15.0

printf("r4 = %.2f\n", r4 = ((x += 1.5) > y) || (b--> 0));
//x บวกจากค่าเดิม 1.5 เป็น 5.5
//5.5 > 4.5 เป็นจริง
//จากเงื่อนไข " || " กล่าวว่า ถ้าเงื่อนไขแรกเป็นจริงแล้วจะไม่ตรวจสอบเงื่อนไขที่สอง
//ดังนั้น b-- จะไม่ถูกนำไปใช้
//ผลลัพธ์เป็น 1 หรือว่าจริง



    return 0;
}